import BlogCard from "@/modules/@common/blog-card";
import React from "react";

const topStoriesData = [
  {
    title: "নৌকা ও ঈগল ঘিরে বিভক্ত আওয়ামী লীগ, সমানতালে চলছে প্রচারণা",
    desc: "এবার নির্বাচনে সবচেয়ে বেশি নির্বাহী ম্যাজিস্ট্রেট নিয়োগ করার কথা উল্লেখ করে আনিছুর রহমান বলেন, এর উদ্দেশ্য একটাই, তা হলো অবাধ, সুষ্ঠু ও নিরপেক্ষ নির্বাচন আয়োজন করা। তাঁরা যদি অবাধ, সুষ্ঠু ও গ্রহণযোগ্য নির্বাচন না করতেপারেন, কোনো কারণে যদি তাঁরা ব্যর্থ হন, তাহলে রাষ্ট্র নিজেই ব্যর্থ রাষ্ট্র হয়ে যাবে। তাঁরা সেটা চাইবেন না। কারণ, এতে বাংলাদেশ সমগ্র বিশ্ব থেকে বিচ্ছিন্ন হয়ে যাব।",
  },
  {
    title:
      "গ্রহণযোগ্য নির্বাচন করতে ব্যর্থ হলে রাষ্ট্র নিজেই ব্যর্থ হয়ে যাবে: কমিশনার আনিছুর",
    desc: "এবার নির্বাচনে সবচেয়ে বেশি নির্বাহী ম্যাজিস্ট্রেট নিয়োগ করার কথা উল্লেখ করে আনিছুর রহমান বলেন, এর উদ্দেশ্য একটাই, তা হলো অবাধ, সুষ্ঠু ও নিরপেক্ষ নির্বাচন আয়োজন করা। তাঁরা যদি অবাধ, সুষ্ঠু ও গ্রহণযোগ্য নির্বাচন না করতেপারেন, কোনো কারণে যদি তাঁরা ব্যর্থ হন, তাহলে রাষ্ট্র নিজেই ব্যর্থ রাষ্ট্র হয়ে যাবে। তাঁরা সেটা চাইবেন না। কারণ, এতে বাংলাদেশ সমগ্র বিশ্ব থেকে বিচ্ছিন্ন হয়ে যাব।",
  },
  {
    title:
      "গ্রহণযোগ্য নির্বাচন করতে ব্যর্থ হলে রাষ্ট্র নিজেই ব্যর্থ হয়ে যাবে: কমিশনার আনিছুর",
    desc: "এবার নির্বাচনে সবচেয়ে বেশি নির্বাহী ম্যাজিস্ট্রেট নিয়োগ করার কথা উল্লেখ করে আনিছুর রহমান বলেন, এর উদ্দেশ্য একটাই, তা হলো অবাধ, সুষ্ঠু ও নিরপেক্ষ নির্বাচন আয়োজন করা। তাঁরা যদি অবাধ, সুষ্ঠু ও গ্রহণযোগ্য নির্বাচন না করতেপারেন, কোনো কারণে যদি তাঁরা ব্যর্থ হন, তাহলে রাষ্ট্র নিজেই ব্যর্থ রাষ্ট্র হয়ে যাবে। তাঁরা সেটা চাইবেন না। কারণ, এতে বাংলাদেশ সমগ্র বিশ্ব থেকে বিচ্ছিন্ন হয়ে যাব।",
  },
];
const CountryNews = () => {
  return (
    <section>
      <div className="container">
        <div className="grid grid-cols-[1fr_308px] gap-5">
          <div className="grid grid-cols-3 gap-3 border-r pr-3">
            {topStoriesData?.map((item: any, i: any) => {
              const isFirst = i == 0;
              const isSecond = i == 1;
              return (
                <BlogCard
                  key={i}
                  data={item}
                  classes={{
                    root: isFirst
                      ? "col-span-2 row-span-2 border-r pr-3"
                      : isSecond
                      ? "border-b pb-4"
                      : "mt-3",
                    imageWrapper: isFirst
                      ? "mb-4 md:!h-[350px]"
                      : "!mb-4 md:!h-[190px]",
                    imageStyle: isFirst
                      ? "!h-full object-cover"
                      : "h-full object-cover",
                    title: isFirst ? "text-28px " : "text-xl !mb-0",
                    desc: isFirst ? "mb-3" : "hidden",
                    date: isFirst ? "" : "hidden",
                  }}
                />
              );
            })}
          </div>
          <div>test</div>
        </div>
      </div>
    </section>
  );
};

export default CountryNews;
